XXSHUB/Open_Source_Yu_STM32L475/.pack/Keil/STM32L4xx_DFP.2.5.0/CMSIS/Driver/USBD_OTG_STM32L4xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2020 Arm Limited (or its affiliates). All 
 * rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        20. October 2020
 * $Revision:    V1.4
 *
 * Driver:       Driver_USBD0
 * Configured:   via CubeMX
 * Project:      USB Full/Low-Speed Device Driver for ST STM32L4xx
 * --------------------------------------------------------------------------
 * Use the following configuration settings in the middleware component
 * to connect to this driver.
 *
 *   Configuration Setting                  Value
 *   ---------------------                  -----
 *   Connect to hardware via Driver_USBD# = 0
 * --------------------------------------------------------------------------
 * Defines used for driver configuration (at compile time):
 *   USBD_MAX_ENDPOINT_NUM: defines maximum number of IN/OUT Endpoint pairs
 *                          that driver will support with Control Endpoint 0
 *                          not included, this value impacts driver memory
 *                          requirements
 *     - default value:     5
 *     - maximum value:     5
 * -------------------------------------------------------------------------- */

/* History:
 *  Version 1.4
 *    Removed include of stm32l4xx_hal_pcd.h header
 *  Version 1.2
 *    Updated to be compliant with HAL drivers version 1.9.0
 *  Version 1.1
 *    Corrected transmitted count for non-control IN endpoints
 *    Removed unnecessary include of cmsis_os.h
 *  Version 1.0
 *    Initial release
 */

/*! \page stm32l4_usbd CMSIS-Driver USBD_OTG Setup

The CMSIS-Driver USBD_OTG requires:
  - Setup of USB clock to 48MHz
  - Configuration of USB_OTG_FS as Device_Only
 
For different boards, refer to the hardware schematics to reflect correct setup values.
 
The STM32CubeMX configuration steps for Pinout, Clock, and System Configuration are
listed below. Enter the values that are marked \b bold.
 
Pinout tab
----------
  1. Configure USBD mode
     - Peripherals \b USB_OTG_FS: Mode=<b>Device_Only</b>
 
Clock Configuration tab
-----------------------
  1. Configure USB Clock: "To USB (MHz)": \b 48
 
Configuration tab
-----------------
  1. Under Connectivity open \b USB_FS Configuration:
     - Parameter Settings: not used
     - User Constants: not used
     - <b>NVIC Settings</b>: disable interrupts
          Interrupt Table                | Enabled | Preemption Priority | Sub Priority
          :------------------------------|:--------|:--------------------|:--------------
          USB OTG FS global interrupt    |\b OFF   | 0                   | 0
     - <b>GPIO Settings</b>: review settings, no changes required
          Pin Name | Signal on Pin | GPIO Pin State | GPIO mode | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
          :--------|:--------------|:---------------|:----------|:-------------------|:-------------|:----------|:----------
          PA11     | USB_OTG_FS_DM | n/a            | Alternate | No pull-up and no..| Very High    | n/a       |.
          PA12     | USB_OTG_FS_DP | n/a            | Alternate | No pull-up and no..| Very High    | n/a       |.
     - Click \b OK to close the USB_OTG_FS Configuration dialog
 
Generate source code by click on Generate source code tool on toolbar, or select project Generate Code, or
or press keys Ctrl + Shift + G.
*/

/*! \cond */

#include "USBD_OTG_STM32L4xx.h"

#include <string.h>

#include "stm32l4xx.h"

#include "OTG_STM32L4xx.h"


#ifndef USBD_MAX_ENDPOINT_NUM
#define USBD_MAX_ENDPOINT_NUM          (5U)
#endif
#if    (USBD_MAX_ENDPOINT_NUM > 5U)
#error  Too many Endpoints, maximum IN/OUT Endpoint pairs that this driver supports is 5 !!!
#endif

// FIFO sizes in bytes (total available memory for FIFOs is 1.25 kB)
#ifndef OTG_RX_FIFO_SIZE
#define OTG_RX_FIFO_SIZE        (640U)
#endif
#ifndef OTG_TX0_FIFO_SIZE
#define OTG_TX0_FIFO_SIZE       (160U)
#endif
#ifndef OTG_TX1_FIFO_SIZE
#define OTG_TX1_FIFO_SIZE       (160U)
#endif
#ifndef OTG_TX2_FIFO_SIZE
#define OTG_TX2_FIFO_SIZE       (160U)
#endif
#ifndef OTG_TX3_FIFO_SIZE
#define OTG_TX3_FIFO_SIZE       (80U)
#endif

extern PCD_HandleTypeDef hpcd_USB_OTG_FS;
#define USBx_BASE              USBOTG_BASE


// USBD Driver *****************************************************************

#define ARM_USBD_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,4)

// Driver Version
static const ARM_DRIVER_VERSION usbd_driver_version = { ARM_USBD_API_VERSION, ARM_USBD_DRV_VERSION };

// Driver Capabilities
static const ARM_USBD_CAPABILITIES usbd_driver_capabilities = {
  0U,   // VBUS Detection
  0U,   // Event VBUS On
  0U    // Event VBUS Off
#if (defined(ARM_USBD_API_VERSION) && (ARM_USBD_API_VERSION >= 0x202U))
, 0U    // Reserved
#endif
};

#define EP_NUM(ep_addr)         ((ep_addr) & ARM_USB_ENDPOINT_NUMBER_MASK)
#define EP_ID(ep_addr)          ((EP_NUM(ep_addr) * 2U) + (((ep_addr) >> 7) & 1U))

static const uint16_t OTG_TX_FIFO_SIZE[4] = { 
  OTG_TX0_FIFO_SIZE, 
  OTG_TX1_FIFO_SIZE, 
  OTG_TX2_FIFO_SIZE, 
  OTG_TX3_FIFO_SIZE 
};

typedef struct {                        // Endpoint structure definition
           uint8_t  *data;
           uint32_t  num;
  volatile uint32_t  num_transferred_total;
  volatile uint32_t  num_transferring;
           uint16_t  max_packet_size;
  volatile uint16_t  active;
  volatile uint8_t   xfer_flag;
  volatile uint8_t   int_flag;
           uint16_t  reserved;
} ENDPOINT_t;


static PCD_HandleTypeDef * p_hpcd = &hpcd_USB_OTG_FS;

